Autodesk.Revit.DB.PatternPlacer.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PatternPlacer.#ctor(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV,System.Boolean,Autodesk.Revit.DB.UV)
Constructor.
origin:
Origin of the pattern on this face mapping the bottom left corner of the material.
dir:
Direction of the pattern placement (rotate the material in the face's UV coordinate plane around origin).
mirror:
Mirror the pattern (rotate the direction another 180 degrees).
scale:
Non uniform uv scale of the pattern. Larger value means larger pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.PatternPlacer.#ctor(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV,System.Boolean)
Constructor.
origin:
Origin of the pattern on this face mapping the bottom left corner of the material.
dir:
Direction of the pattern placement (rotate the material in the face's UV coordinate plane around origin).
mirror:
Mirror the pattern (rotate the direction another 180 degrees).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.PatternPlacer
This class defines the pattern placement of material on a face.
This works together with the material settings defined in Texture Editor.
Since:
2022